Управление_закупками/src/Catalogs/РабочаяДокументация/РабочаяДокументация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочаяДокументация</name>
  <attributes>
    <name>БазовыйДокумент</name>
    <type>
      <types>CatalogRef.БазовыеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделПроекта</name>
    <type>
      <types>CatalogRef.БазовыеРазделыПроекта</types>
    </type>
  </attributes>
  <attributes>
    <name>Ревизия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектСтроительства</name>
    <type>
      <types>CatalogRef.ОбъектыСтроительства</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСметногоРасчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Управление_закупками/src/Catalogs/РабочаяДокументация/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы    

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьЭлементыФормы(); 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
 
	// Проверить наличие совпадающей записи в справочнике	
	Если  СправочникиСервер.ИмеетсяДвойникВСправочнике(ТекущийОбъект)  Тогда 
		
		ТекстСообщения = НСтр("ru = 'Отказ в записи элемента.
		|Рабочая документация с таким наименованием уже существует в информационной базе.
		|Необходимо указать другую информацию.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.Наименование",,Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы     

&НаКлиенте
Процедура БазовыйДокументПриИзменении(Элемент)
	Объект.РазделПроекта = ""; 
	Объект.Ревизия = "";
	ИзменитьНаименованиеРД();
	НастроитьЭлементыФормы(); 	
КонецПроцедуры


&НаКлиенте
Процедура РазделПроектаПриИзменении(Элемент)  	
	Объект.Ревизия = "";
	ИзменитьНаименованиеРД();
	НастроитьЭлементыФормы(); 	
КонецПроцедуры


&НаКлиенте
Процедура РевизияПриИзменении(Элемент)   
	//Объект.Ревизия = НРег(Объект.Ревизия);
	СтроковыеФункцииКлиентСервер.УдалитьЛишниеПробелы(Объект.Ревизия);
	Объект.Ревизия = СтрЗаменить(Объект.Ревизия,",",".");
	ИзменитьНаименованиеРД();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаКлиенте
Процедура НастроитьЭлементыФормы() 
	//Управляет видимостью полей ввода для проекта в зависимости от выбранного базового документа
	
	Если  СправочникиКлиент.РабочаяДокументацияЯвляетсяПроектом(Объект) Тогда
		Элементы.РазделПроекта.Видимость = Истина;
		Элементы.Ревизия.Видимость = Истина;	
	Иначе                                        	
		Элементы.РазделПроекта.Видимость = Ложь;
		Элементы.Ревизия.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.РазделПроекта) Тогда
		Элементы.Ревизия.Доступность = Истина;
	Иначе
		Элементы.Ревизия.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры    


&НаСервере
Процедура ИзменитьНаименованиеРД()
	
	Объект.Наименование = "";
		
	Если ЗначениеЗаполнено(Объект.БазовыйДокумент) Тогда
		Объект.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.БазовыйДокумент,"Наименование")
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.РазделПроекта) Тогда
		Объект.Наименование = СтрШаблон("%1-%2",Объект.Наименование, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РазделПроекта, "Наименование"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ревизия) Тогда		
		Объект.Наименование = СтрШаблон("%1 %2", Объект.Наименование, Объект.Ревизия);	 		
	КонецЕсли; 
	
Конецпроцедуры 

#КонецОбласти
